{"catalog_versions": {"1": [{"author": "nataryeahbuddy", "desc": "Discontinued. See: \"Advanced Battle Systems\".\n\nGet five shields and power your advanced weaponry! Thanks to a breakthrough by Engi scientists, ships are now able to have five shields and level twelve weapons. The Engi Advanced Technology Development Division has released this technology to the Federation, in hopes that they can beat the rebels. You can pick it up today, at your local Zoltan Trade Hub or on this post!\n\nKnown Bugs:\nAsteroid Fields are messed up and you die... unknown cause, code seems to be fine.\n", "thread_hash": "dbb90b01a5931e59a6e2cf5e6b3054f6", "title": "Advanced Weapons and Shields", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11058", "versions": [{"hash": "1368ecb746bea1fab261d8a5eb8c23f1", "version": "1.2"}]}, {"author": "nataryeahbuddy", "desc": "Features\n- Max power of teleporter increased to 4.\n  - Level 4 is instant cooldown, but costs 150 scrap.\n- Max power of cloaking is increased to 8.\n  - Level 8 is 40 seconds cloak.\n- Max power of weapons increased to 12 (from Advanced Weapons and Shields).\n  - Level 12 Weapons=12 weapon energy bars.\n- Max power of shields increased to 10 (from Advanced Weapons and Shields).\n  - That's 5 shield bars!\n", "thread_hash": "6bd30a167155e7650ae3fee2c8e84ce1", "title": "Advanced Battle Systems", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11469", "versions": [{"hash": "b45b9610ef83386da780a88c8e29d027", "version": "1.1"}, {"hash": "4b88a7f3664f96d54de0fe83fd17f2ed", "version": "1.2"}]}, {"author": "aedyr", "desc": "This is a simple mod that disables fleet pursuit and adds a bit of flavor text at game start.\n", "thread_hash": "2e6b44eb9c2d6db24fc9e683466720ae", "title": "Disable Fleet", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=4&t=2593", "versions": [{"hash": "26e599dff4f8c622a53948caba4d9100", "version": "1.0"}]}, {"author": "blaeron", "desc": "Faster Than Hard Light is a total conversion, aimed at bringing the FreeSpace 2 universe into the FTL engine.\n\nI currently don't have much to show for Faster Than Hard Light (okay sorry), but I do have a few pretty pictures and a general outline.\n\nAnyway, here's what FTHL will include if I ever release this:\n\nMost smaller enemy ships become corvettes or frigates, with ships that approach the size of a playable ship being Destroyers. Playable ships also become different types of destroyers, with one exception, the Arpyia Frigate. Drones becomes a fighterbay. Also, Rockmen become Vasudans, Mantis become Shivans, sekkrit race becomes Ancients, and the Rebels also become the Shivans.\n\nOh yes, a demo, a demo! Not much, and most of the stuff is horribly unbalanced, broken, or not implemented (Only a single new ship, GTD Orion, and only a few weapons were added, and the new beams that pierce all shields are horribly unbalanced), but it is at least slightly functional. The Orion even has gibs and proper weapon placement!\n", "thread_hash": "3d73f835ab5a206f97b88c8533c6e5bf", "title": "Faster Than Hard Light", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=4&t=2939", "versions": [{"hash": "72e45464194aa306397aa1e8223b3cf6", "version": "Demo WIP"}]}, {"author": "Whale Cancer", "desc": "This mod is supposed to present the foundation of the federation, rather than its fall. The Engi and Zoltan are presented as allies while the Mantis, Rock, and Slugs as aggressors; the final battle is a unifying battle in which the Engi, Zoltan, and Humanity stand against the Rock, Slugs, and Mantis (I'm thinking of casting the slugs as the manipulators of this 'axis'). The old playable ships associated with those races are mini-bosses at the end of quest chains and, of course, they will be used in the final battle as well.\n\nThe plan is also to rewrite a whole bunch of events, as I intend the mod to be event focused.\n", "thread_hash": "c0876479b4618f539815c6abd1240fd3", "title": "Foundation of the Federation", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=4&t=2947", "versions": [{"hash": "???", "version": "N/A WIP"}]}, {"author": "Morat48", "desc": "Part of the \"Ghost Ships and New Items\" collection.\n\nThis mod creates two ghost ships, crewed by ghosts and equipped with unique weapons. One of these ships is a variant of the starting Kestrel, and the other is an alternate version of Stealth A. Since ghosts do not require air, the ships lack oxygen systems. This mod also adds a few ghost-related events, as well as some blue text options for ghosts. The Federation cruiser type A exchanges its human crew member for a ghost, but retains its other normal crew and still has an oxygen system.\n", "thread_hash": "4352c6900ef78495489eb9ac75bf4a48", "title": "Ghost Stories", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=10793", "versions": [{"hash": "9887fca7eff56923ab3fb712e95066a0", "version": "2013-01-19"}]}, {"author": "Morat48", "desc": "Part of the \"Ghost Ships and New Items\" collection.\n\nThis mod removes the big flashing \"low oxygen\" warning, which can be annoying on a ghost ship.\n", "thread_hash": "4352c6900ef78495489eb9ac75bf4a48", "title": "Remove O2 Warning", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=10793", "versions": [{"hash": "7759c317d925f3a7e4cb300bace6a754", "version": "2013-01-16"}]}, {"author": "Morat48", "desc": "Part of the \"Ghost Ships and New Items\" collection.\n\nThis mod expands the selection of equipment, adding new drones and weapons, and allowing cloak and teleporter systems to be upgraded by one additional level. Rather than spoil the experience of discovering all the new items, I'll just say that the new equipment includes a variety of plasma weapons that deal damage and cause fires, a torpedo weapon that acts as a slow moving missile, and the deadly anti-bio terminator drone, among many others.\n", "thread_hash": "4352c6900ef78495489eb9ac75bf4a48", "title": "Equipment EX", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=10793", "versions": [{"hash": "3db44e4835e96a7147bab3717905a13f", "version": "2013-01-19"}]}, {"author": "Morat48", "desc": "Part of the \"Ghost Ships and New Items\" collection.\n\nA list of names taken from a number of sci-fi sources, including Star Trek, Star Wars, Firefly, Red Dwarf and many others. The mod comes has two versions: One which will replace any existing names, and another to append to an existing list (allowing you to use these names along with the default list, or any other modded name list).\n", "thread_hash": "4352c6900ef78495489eb9ac75bf4a48", "title": "Sci-Fi Names", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=10793", "versions": [{"hash": "8913e54d19ec7f218ac2d1e1c91e3959", "version": "Clobber 2013-01-16"}, {"hash": "fdae4fd6402b41226c6d429c0b48812f", "version": "Append 2013-01-16"}]}, {"author": "Morat48", "desc": "Part of the \"Ghost Ships and New Items\" collection.\n\nThis is a useful utility mod for those who want to unlock certain ships without going through the unlock quests. With this installed, click on the tutorial, and you'll be given an option to immediately unlock a ship. This works for A type ships, achievements will still be needed to unlock B types. The tutorial can still be used normally while the mod is installed.\n", "thread_hash": "4352c6900ef78495489eb9ac75bf4a48", "title": "Manual Ship Unlocker", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=10793", "versions": [{"hash": "c6204da7af84a959d4c075e6c99393aa", "version": "2013-01-16"}]}, {"author": "Lord0fHam", "desc": "I have decided to make a total conversion of the game to make it Halo themed. I'm going to add new weapons, ships, sectors, events, etc. I have some ideas, but I need more. I am going to make all new sectors after all so I need many new events. If there are any Halo fans (or not) out there that would like to suggest any new events, weapons, etc. or help out with art for new things, please post below. I hope to make this mod a total conversion, ending with the replacement of the final boss with some super powerful Covenant Cruiser to stop Truth from firing the Halos.\n\nThis mod is not compatible with other mods that change the Kestrel A Layout! In the future there may be other mods it won't be compatible with.\n", "thread_hash": "7c43fe82d068dd7085dc9a22ed76d8fd", "title": "Halo", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=12&t=11475", "versions": [{"hash": "1e381090dec2bca663a709d770eb0940", "version": "1.0.1 WIP"}]}, {"author": "Kieve", "desc": "DISCLAIMER - This mod is still in \"beta\" status and requires testing. Some weapons may feel imbalanced or overpowered, others underpowered or useless. Please leave detailed, constructive feedback.\n\nReplaces the Zoltan-B ship.\n\nFeatures\n- Arc Beam - Antipersonnel particle beam. Damages systems and crew, starts fires.\n- Aurora Mass Cannon - Anti-ship cannon that pierces all shielding.\n- Bolide Ion Rocket - Deals no hull damage, but very effective at disabling shields and systems.\n- Sunfury Rotary Autocanon - Rapid-fire burst weapon. Fast reload but will suck your ammo dry.\n- Crew: 2 Zoltan\n\nAlso includes the Incursor Theme, replacing the default title music.\n\nThe Incursor \"Archon\" was designed to strike fast and hard, weakening the enemy for their larger capital ships. The Archon's weapon array is devastating indeed, but heavy reliance on limited ammunition makes it a poor choice for extended mission assignments.\n", "thread_hash": "3acaa80e3d2cecae869436ed0835a35f", "title": "Incursion", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=10361", "versions": [{"hash": "fd357ea6465756e45e393feffb986f5f", "version": "0.9c Beta WIP"}]}, {"author": "DrkTemplar", "desc": "What is FTL Infinite Space?\nThe universe is vast. With FTL Infinite Space you can explore the universe to your hearts content, or till you blow your ship to bits. Infinite Space will jump you from sector to sector, while you search for ancient powerful artifacts, and advanced technology to enhance your ships capabilities. Learn when to fight, and when to run. Dominate or be destroyed.\n\nFeatures\n- No Rebel Fleet, No Rebel Boss, No hard stop end of game.\n- Redesign of Sectors, and Enemy ships.\n- Sector \"mini bosses\" (Player Cruisers images).\n- New custom weapons.\n- New custom drones.\n- New events\n- A different gaming experience than vanilla.\n- High-res background graphics mod by Splette!\n- DronesPlus mod by karmos!\n", "thread_hash": "1a505ca71e3c454db68254f0a3a57365", "title": "Infinite Space", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=12&t=3542", "versions": [{"hash": "de440631df2c0b8274a0f37ccff79206", "version": "0.4.4 Original Bkgs"}, {"hash": "516e20d80b9c6c878b0730c3e7978576", "version": "0.4.1"}, {"hash": "5bad4d1ec8fcc188142ce2861f8650bb", "version": "0.4.4 Hi-res Bkgs"}, {"hash": "9de0823d7d8b33cf27ac2807e085cd45", "version": "0.4.3"}]}, {"author": "Captain_Brian", "desc": "Backstory:\nCerberus has found a way to control the reapers. The reaper war has been raging on since the failure of the Crucible Project, and the whereabouts of the Normandy and its crew are unknown.\n\nData mined from the Cerberus network suggests a tachyon pulse emanating from The Illusive Man's command ship has \"erased\" the reaper collective consciousness, and replaced it with a rudimentary command recognition structure that Cerberus can send commands to. The data also suggests that the Illusive Man's command ship is the only ship capable of sending commands to reaper forces, and that eliminating it will permanently disable the reapers.\n\nUnfortunately, Cerberus have completely disabled galactic communications, which leaves it up to you to deliver this data to Alliance Command. Reaper forces are preoccupied with decimating planetary infrastructure, but the Cerberus fleet has only one target...\n\nYOU.\n", "thread_hash": "e1ff5a7d2b0b51b7414d302792aea4b0", "title": "Mass Effect Total Coversion", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=8936", "versions": [{"hash": "278414a9d1385dc2ec2676590afb3da3", "version": "0.013"}]}, {"author": "RichText", "desc": "Avast, thar be a pirate mod now!\n\n\"Pirates!\" has rewritten events, changing the reactions and choices you can make, as well as altering the storylines. Pirate chasing civilian? You can aid the civilian OR the pirate. Caveman stuck on a moon? Sure, you can risk letting him join your crew... or you could throw him in the composter and turn him into fuel. Use your pirate charm to talk your way out of tricky situations or barter for more plunder, and flash the jolly roger to turn other pirates to your alliegance!\n\nOn the aesthetic side, the rebel fleet has been replaced with the Federation military, dark green ships that seek to destroy or arrest you. You pilot a \"liberated\" model of one of these Federation ships, the \"The Black Spot.\" The mod also rewrites all tooltips into \"Pirate-Speak,\" a much more suitable dialect of English for those of you who are swashbuckling corsairs. All NPC crew-members will now have pirate names, including favorites such \"Peg-leg\" and \"Patchy.\" In addition, the first of many new weapons has been added, the Cast-Iron Ship's Cannon, masterfully nailed to the side of your ship with wooden planks, and accompanied by a hearty quantity of lead cannonballs for you to launch through the depths of space.\n", "thread_hash": "fdbdaf6589ca2af263fb6641760b042a", "title": "Pirates!", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=3273", "versions": [{"hash": "1d34784e28007aa92cbb05086d0d583e", "version": "2.2"}, {"hash": "1de167d54d84556341ffcbc572e0a2d3", "version": "2.0"}, {"hash": "fb6f3e5c282906bdd79b2b294777cf1c", "version": "2.1"}, {"hash": "561460bacb6e83677334b6bb957f5344", "version": "1.0"}]}, {"author": "blaeron", "desc": "Includes:\n- Burst Laser Mark IID\n- New Pegasus and Aristea missile sprites\n- Voulge beam\n- Plasma Beam\n- Beam Drone Mark II\n- Improved drone speeds and fire rates\n- Added Elite Rigger\n- Changed the playable Rockman ships somewhat\n- New nebula and background sprites, and new warnings.\n- New solar flare and ion storm sounds.\n", "thread_hash": "10ffac10ee66440ecc8e1fcea6dd4c1a", "title": "Somewhat Faster Than Light", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=4&t=2603", "versions": [{"hash": "e7558768ce75524079d9e58d521f54dd", "version": "1.1"}]}, {"author": "thashepherd", "desc": "With cries of \"Sic Semper Tyrannis\", nearly a quarter of the United Empire's worlds have seceded to form their own nation. They call themselves the \"Pilgrims\". The Empire's legislature interpreted this secession as treason, and the overwhelming might of the loyalist fleet has fallen on the Pilgrims. Although the situation is militarily hopeless, your family and friends have all joined the resistance - and so you shall.\n\nSonata is a total conversion mod for FTL based on the storyline of Endless Space by Amplitude Studios, with modifications. It aims to create a gritty, realishtic, and morally ambiguous story on the FTL engine where politics, motivations, and the nature of humanity itself affect your journey.\n\nFeatures\n- All-new soundtrack\n- All-new backgrounds\n- All-new story and events\n- All-new UI\n- Custom player ships\n- Custom enemies\n- All-new weapons\n- Custom weapon graphics, and animations\n- New sound effects\n", "thread_hash": "3e0d8f09ba612d167e80368e4bd79e3d", "title": "Sonata Total Conversion", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=6517", "versions": [{"hash": "b13de0c782576c9c20f0ef6d0fe317c5", "version": "7"}]}, {"author": "Kieve", "desc": "This mod alters your encounters with the Rebel Fleet to increase the risk / reward factor, giving you the option to bring their advance in a sector to a screeching halt - or die horribly in the face of overwhelming odds!\n", "thread_hash": "08f7767e979f2228c474deb2fdcdde24", "title": "Turning the Tide", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=4&t=3056", "versions": [{"hash": "a5a73f329fb153dc445eca672b51114b", "version": "1.0"}]}, {"author": "DauntlessK", "desc": "This mod is meant to give you the feeling that you're a captain in the dark and twisted universe that is Warhammer 40,000. It is starting off as a ship, weapon mod, but will continue to grow into something even bigger.\n", "thread_hash": "45d4c8a847a945382311da3105cd07d3", "title": "Warhammer 40k - Battlefleet Gothic Mod", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=12&t=11604", "versions": [{"hash": "???", "version": "N/A WIP"}]}, {"author": "DryEagle", "desc": "Features\n- Custom graphics for pretty much everything\n- Customised ship hull\n- Customised crew sprites, shield graphic, room interiors\n- Gibs with proper layering etc\n- Unique weapons\n- Heavy, heavy focus on killing ship crews. Lots of boarding drones, weapons that lock down rooms and cause breaches to suffocate the crew without causing direct damage...\n- No oxygen system. Specially adapted version of the nanobot augment which heals crew at exactly the rate that they would take suffocation. Only works on crytals, others will still die unless stuck in the medbay.\n- Custom pricing (and in some cases levels) for almost all ship upgrades.\n- Included tutorial pointing out some important details about no-oxygen system.\n\nNote: There are no low-oxygen stripes (the floor will still turn pink however). Because this ship has no O2 system, I chose to remove them for visual pleasantness. Bear this in mind when attacking enemy ships.\n\nReplaces the Kestrel-A ship.\n\nI am not including any custom events, so that this remains compatible with as many mods as possible.\n\n- All modified files are renamed to be specific to this ship, except for crystal crew sprites and lockdown effect, and oxygen stuff. Basically, load it last and it will be compatible with anything.\n- If you wish just rename the relevant line in blueprints file to have it replace another ship instead.\n", "thread_hash": "c4de807ba790239c6d44f9de89bc700b", "title": "The Amber Shard", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11703", "versions": [{"hash": "8a5a336510ac21b1e5b24e0657287b5d", "version": "1.0"}]}, {"author": "Harnisfechten", "desc": "The Cobra Class Destroyer is a ship from the Warhammer 40k Universe. It is known as the smallest independent Imperial ship (ie it can patrol alone, and is not a fighter or bomber based on another ship).\n\nDue to difficulty in finding an overhead image of the ship of suitable quality, I decided to try something different and make the ship from a side view. Sure, the crew and rooms are all top view, but I actually think it looks pretty good.\n\nThe Cobra is armed with a dorsal weapons battery (a Burst Laser Mk II in the game) and prow-mounted torpedoes (2 Hull Missiles in the game). Note that the crew are not to-scale with the ship, as the ship is approximately 1.5km long (yeah, 40k ships are big). I like to think that instead of individual characters, each crew member represents a team of people, so the pilot is not just one pilot, it is the entire command staff on the bridge of the ship, and the weapons guy is not one guy, it is a large number of gun crew, the ratings that load the weapons, the engineers that serve them, etc.\n", "thread_hash": "6264da50ab73f21b95e04a874255df1b", "title": "Battlefleet Gothic - Cobra Class Destroyer", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=12&t=10431", "versions": [{"hash": "3d50785d23090ecb0aa0ede535b0c24b", "version": "1.0 WIP"}]}, {"author": "FrostWyrmWraith", "desc": "Here we have a pair of ships in one file-the Galactica and the Pegasus.\n\nThe Galactica begins with a missile launcher and two Vipers as a homage to what it fought like in the series.\n\nWith the Pegasus I didn't want to make the ship too overpowered so I gave it two KEW batteries and a single Viper, though starting it with more and giving it more drone slots would have been more accurate. I wanted it to play a bit differently, so it focuses more on weapons than fighters. In the game you can find the Viper Mk VII, as well, so keep your eyes peeled!\n", "thread_hash": "49de32110c905eb33e5ef07f888afbfd", "title": "Battlestars", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11940", "versions": [{"hash": "544a96a8c4af93c0099a55d10563e8fd", "version": "1.0 2013-03-06"}, {"hash": "4b2d7e5f6d80b475a9b4e9d0d740ff41", "version": "1.0"}]}, {"author": "Zaffre", "desc": "This cruiser uses fire weaponry. It starts with two extended fire beams, one laser weapon that starts fires, and a missile that starts fires. It starts with no shields or cloaking. To give the ship a chance, it has a unique drone upon start. The crew is composed of three Rock. The sprites are modified versions of the Kestrel B layout.\n\nReplaces the Kestrel-B ship.\n", "thread_hash": "0872231554efba1a11bec2271f17d0d1", "title": "Blazing Cruiser", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=4&t=3133", "versions": [{"hash": "141f70d3643d275504c04993fdaab110", "version": "1.1"}, {"hash": "af34777f9b70769828ea27f24b5b298a", "version": "1.4"}, {"hash": "c522d5da78aebbd55a6f68cc6e98162d", "version": "1.3"}, {"hash": "eb5484304b45b3be8ff043aa78c0defc", "version": "1.5"}, {"hash": "a23e32a6591af658e4ce9ab92403c4aa", "version": "1.0"}, {"hash": "17b671da29f071521e8e54f77cb6c325", "version": "1.2"}]}, {"author": "EchoesofOld", "desc": "This ship is an unarmed vessel that relies on its cloak to survive.\n\nReplaces the Engi-A ship.\n\nPlease Note:\nI have discovered that you can NOT load my ships simultaneously. I dont know WHAT causes this, but im looking into it.\n", "thread_hash": "d8ecd11fad226a01436e233f08ba822f", "title": "The Buffalo", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11327", "versions": [{"hash": "642c121e47964c6e825c4b89da7a7e7e", "version": "1.1"}]}, {"author": "MeGusta", "desc": "This is the C-1092. It is made for teleportation combat. You get in, then out as quick as possible. I made this because I could not find any ships of this type. It looks the same as the Type B stealth fighter.\n", "thread_hash": "04ef703bdcb3dcf80859040a2928e490", "title": "C-1092", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11434", "versions": [{"hash": "848d44e196b16fec980862432d82fa1f", "version": "1.1 No Human"}]}, {"author": "zaratustra", "desc": "The Duality is divided into two sections.\n", "thread_hash": "158f664b69f336be816be618902437ba", "title": "Duality Cruiser and Merchant Cruiser", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=4&t=2729", "versions": [{"hash": "4d68f90233698b7db9c792ae3573e2fe", "version": "1.0"}]}, {"author": "DryEagle", "desc": "The story:\nYou have been comissioned to help escort some freighters which carry intel and technology vital to the federation. Unfortunately weaponry is in short supply so you had to salvage what you could:\n- A prototype ion pulse weapon\n- A defective burst laser (no secondary effects e.g. no fires, no crew damage)\n- An unstable nanite repair bomb (may overload systems it repairs, starting a fire. 10% chance)\nFortunately you were given a top-of-the-line point defence drone to help protect the unshielded freighters.\nThe freighters also have ample space to install cloaking and a large industrial-sized teleporter, should you manage to come across vendors willing to provide the hardware necessary for the upgrade.\n\nA shielded frigate escorting unshielded freighters.\nThe odds are stacked against you.\nWill you survive and defeat the rebel fleet?\n\nReplaces the Kestrel-A ship.\n\nMod data:\n- The replaced ship can be changed in blueprints append. There are no dependencies.\n- Sll names in internal files are unique to this mod so it should be entirely compatible with everything.\n- No events, this is just a ship. so you can use it with more or less everything, just load it last.\n- Gibs, cloaking graphics, menu graphics - the works.\n", "thread_hash": "0493e82769c2067b4a8e0704c986aec8", "title": "Escort Duty", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11531", "versions": [{"hash": "bed7f8c867bb728ce852f4fcccf923e8", "version": "1.0"}]}, {"author": "nataryeahbuddy", "desc": "Lockheed-Martin/Boeing F-22A Raptor for FTL\nPart of a \"Present-Time\" Total Conversion that MAY be coming soon! (I'm working on an F-35)\n\nIntro:\nThe Lockheed Martin/Boeing F-22 Raptor is a single-seat, twin-engine fifth-generation supermaneuverable fighter aircraft that uses stealth technology. It was designed primarily as an air superiority fighter, but has additional capabilities that include ground attack, electronic warfare, and signals intelligence roles.\n", "thread_hash": "d5fd366a25b7a9a7e8fb22f480406336", "title": "F-22A Raptor", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11537", "versions": [{"hash": "7981bcf4ae27eeb3551ea46adedfe779", "version": "1.2"}]}, {"author": "Revenant721", "desc": "Greetings FTL and Halo fans!\n", "thread_hash": "c4ed37f4842eb68bb5e7599a54cacdef", "title": "Halo 4 - Broadsword Ship", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11620", "versions": [{"hash": "3f17e969074ad365d4d3e850d51fdca1", "version": "1.1"}]}, {"author": "FrostWyrmWraith", "desc": "The Covenant battlecruiser featured heavily in the Halo series! It starts with a slug and two engi. It also adds the plasma torpedo to the game. It requires two power and has a fairly long charge up, but does two damage and is pretty much guaranteed to cause fires.\n\nReplaces the Slug-A ship.\n", "thread_hash": "a925d0ba5d43b6d90def7bfe732da653", "title": "Halo: CCS-Class Battlecruiser", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11938", "versions": [{"hash": "21fc1a22707e4b30e806b1a2e9f66674", "version": "1.0"}]}, {"author": "sandtrooper956", "desc": "An edit of the Rock-B ship.\n\nIt has 200 hp but it its systems are these:\n- Level 3 Engines\n- Level 4 Weapons\n- Level 1 Oxygen\n- Level 1 Piloting\n\nThey are very limited; no way to heal crew until you get a medbay, which could take a while.\n\nStarting crew: just 2 rockmen.\n\nIt only has 2 Weapon slots, starting with:\n- Heavy Laser II\n- Ion Blast\n\nReplaces the Rock-B ship.\n", "thread_hash": "6b118795dc49e0782797a676fa285ef1", "title": "Hardcase", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=12041", "versions": [{"hash": "6c3ee488fc3cc03ce2b4c33cc9678e80", "version": "1.0 2013-03-06"}, {"hash": "60b7591a6cbc4ade08b83b5c544ccfcb", "version": "1.0"}]}, {"author": "BadgersCanSpace", "desc": "\"By modern standards, the Federation Spaceworks Kingfisher-class Field Hospital and Medical Supply Vessel is outdated. Older even than the venerable Kestrel-class, they fell into an uncomfortable balance of being too poorly equipped for military use, but overpowered and overpriced for the civilian market. Their shields are weak by modern standards and their lack of armament prevented any private usage other than freight haul. However, due to their relatively easy modification and powerful engines, they remain a firm favourite with playboys and pirates.\" - Jane's Military Spacecraft Edition XXVIII\n\nReplaces the Engi-A ship.\n", "thread_hash": "b95b288bec588ef8fd84d4c036e2d236", "title": "The Kingfisher", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=12&t=11522", "versions": [{"hash": "b6e4d637e2cf1ce18b8d29e07038f37c", "version": "1.1"}]}, {"author": "Wiseworm", "desc": "It's a Klingon K'vort-class Bird-of-Prey (replacing Mantis cruiser B) named PIvlob Do (klingonese for Warp Factor Speed).\n\nAfter a little busy time I got my hand again on this to present you a new ship!\nThe Vor'cha-Class Klingon Battle Cruiser \"IKS QeylIS BetleH\" (klingonese: The Sword of Kahless).\n", "thread_hash": "46a9a5f464e67eb9f63b7497692f0e30", "title": "Klingon Bird-of-Prey", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11086", "versions": [{"hash": "ee02457c0d7f3dc1217d8fb217ada74a", "version": "2.0"}]}, {"author": "TheDarkdu42", "desc": "So, The Lost Hunter is a ship in the original game but it is improved and overpowered now!\nYou can destroy the rebel ships Faster than Light!\n\nIt has got 99 hull points, unlimited energy, all systems upgraded to the max.\n\nReplaces the Stealth-A ship.\n", "thread_hash": "28dabe5edb77f69b92802c893dc05d75", "title": "The Lost Hunter", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=10873", "versions": [{"hash": "7308cdebfc8b62ec1d80d5e8e0d837cc", "version": "1.0"}]}, {"author": "UltraMantis", "desc": "Marauder ships are characterised by powerful weapon systems that seem to require massive power to operate, even at the expense of all other systems. While not refined, the weapons are effective. Usually disableing and stripping ships clean to provide resources required for the vessel to reach it's full potential. Even though their origins and source of technology are a mystery, the ships are crewed by common races though it's hard to say if they joined up willingly or are slaves.\n\nFair warning to those eager to play, these ships will not be easy. My guess is that difficulty will be between NORMAL and EXTREME, depending on which ship you pick.\n\nThis mod was made without regard for compatibility with other mods. However, it will work with visual, events, and weapon mods, but will almost certainly break system mods. Whether or not it works with other ship mods is unpredictable. I recommend that you install this as a single mod.\n", "thread_hash": "72866888a9ed7d55024ea935461d3c21", "title": "The Marauders", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11501", "versions": [{"hash": "ef5cdc4b6413f4013959271155ef84be", "version": "1.0 2013-03-04"}, {"hash": "3851b27cd288083356b433436eda6195", "version": "1.0"}]}, {"author": "HalfDemon23", "desc": "A gigantic Rock Dreadnought that was intended to blockade the entire Rebel Fleet; however the Rebels attacked the construction base before it was completed, resulting in the Prototype limping out of the attack. While it lacks secondary systems, the Mor-Saxum has an impressive armament and unrivalled hull strength, now TRIPLE of a standard Rock Cruiser - if its systems were brought up to full strength... not even a Rebel Fleet could stand in its way.\n\nReplaces the Rock-A ship.\n", "thread_hash": "09e54784dbf67a2d92a395f28570e039", "title": "Mor-Saxum", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11514", "versions": [{"hash": "e50d7504123fab5224248c8704a5bc12", "version": "0.6"}]}, {"author": "EchoesofOld", "desc": "The NightHawk is a cheap suicide fighter, meant for quick hit and run fights. It normally operates in packs, but you dont really have that option, do you?\n\nI designed this ship with the intention of being a total jerk (Much like Vechs and his Minecraft Super Hostile maps.) If you people like it enough, I'll re-balance it to be more fair.\n\nReplaces the Slug-A ship.\n\nPLEASE NOTE: I have discovered that you can NOT load my ships simultaneously. I dont know WHAT causes this, but im looking into it.\n", "thread_hash": "d011f5f173faa113fadeb8aed0ce1a11", "title": "The NightHawk", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11330", "versions": [{"hash": "6bf83f50fcdf3b13d366ad745745f911", "version": "1.0"}]}, {"author": "Kieve", "desc": "'Weapon Systems: Offline. Drone Control: Offline. Engines: Offline. Shields: twenty-five percent power. Hull breaches detected in Medical and Oxygen rooms. Fires detected in...'\n\nThe lidless green eye of a lone Engi winked out, the mechanized equivalent of a wince. The Vortex was dying around him, clouds of debris surrounding the hull where the Rebel fighter's missiles had blasted it. Streams of precious oxygen vented into empty space, giving the ship a slight spin that the damaged engines could no longer compensate for. And without its precious repair drones active, The Vortex had no hope of recovering. One Engi was no match for the destruction surrounding him. Hot air escaped his vents in something very much like a sigh, his overtaxed processors reaching one last viable option: a gray finger stabbed down, activating the ship's distress beacon. Code willing, there'd be a Federation ship out there that could at least deliver some small measure of retribution for the loss of The Vortex...\n\nReplaces the Engi-B ship.\n", "thread_hash": "f81da5b68fc54068c4701958610f8d87", "title": "Obsidian Cruiser", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=4&t=2574", "versions": [{"hash": "e1bcbe57235fc41546ac1470f9bd7b29", "version": "1.2.2"}]}, {"author": "Baldwebby360", "desc": "A playable rebel flagship.\n\nReplaces the Slug-A and Slug-B ships.\n", "thread_hash": "a299a691648b3e787cf7b700a669a263", "title": "Playable Rebel Flagship", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=12&t=10108", "versions": [{"hash": "9643c9a6af40bfd7710157dd49f00390", "version": "1.0 Rebel WIP"}, {"hash": "0a7890230e067e260d1e617a5e92871b", "version": "1.0 Fed WIP"}]}, {"author": "Dark Spartan", "desc": "The Predator is a heavily-armed cruiser that relies on its ability to swiftly damage and destroy systems to make up for its lack of defenses. Its only defensive measures from the start are a rank 2 cloaking device and a few drones. Shields, door control, and teleporters must be purchased. However, with any cunning, you should be able to kill them before they kill you.\n\nReplaces the Engi-B ship.\n", "thread_hash": "7a57ff0cadd8591af860ee703446e72b", "title": "The Predator", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11474", "versions": [{"hash": "cd9ed7b2a4e04cbeb3d06e7031009766", "version": "1.1 WIP"}]}, {"author": "Ginger Dragon", "desc": "A prototype of the Rebel Flagship discovered by Federation scouts that was scrapped and spaced by the Rebels due to its key weakness. Its high-power weaponry makes it more unstable than most ships.\n\nReplaces the Kestrel-B ship.\n", "thread_hash": "08d2783a425129268a1af3260ba2e2bc", "title": "Rebel Flagship Prototype", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=10845", "versions": [{"hash": "3a8365874d541aa0412d6afd7b7d78e5", "version": "1.2 BBF"}, {"hash": "bada632225d8a11fdde87c279681b176", "version": "1.2"}, {"hash": "2a11e8c23fb9845b570fddabbd3c8a3a", "version": "1.3"}, {"hash": "b689a69cca46ab99c9af83a9dbe2c63c", "version": "1.0"}]}, {"author": "Jonfon", "desc": "The Nexus Robotic Salvage Cruiser\nAn Engi ship designed to work without a crew. It is a originally a repair, refitting and salvage vessel which has been sent on a desperate mission by its creators.\n\nReplaces the Engi-B ship.\n\nSlug Bomber\nUses an array of new bombs and a small Disruptor.\n\nReplaces the Slug-B ship.\n", "thread_hash": "6aff1d0ea1fe8860fb43e6a17400c07f", "title": "Robotic Cruiser", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=10839", "versions": [{"hash": "b44022f5918cab6b8674ccc87e13a6d3", "version": "0.4 WIP"}]}, {"author": "DryEagle", "desc": "A prototype diplomatic vessel, the Scarab was not designed with heavy fighting in mind - however it is more dangerous than it first appears.\n\nReplaces the Kestrel-A ship.\n\nAll files/graphics which have been edited use custom names specific to this mod; to make it replace a different ship besides the kestrel, simply change one line in the blueprints append file and everything will still work.\n", "thread_hash": "5117eff894eea92772bf0d6827db91fb", "title": "The Scarab", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=10942", "versions": [{"hash": "ca9d59bb3f605f31949f0e9b631bd8e0", "version": "1.0"}]}, {"author": "Heathen", "desc": "StarBug is is one of the old class-2 ship-to-surface vessels - the very model, in fact, that was withdrawn due to major flight design flaws.\n\nReplaces the Stealth-B ship.\n", "thread_hash": "8c8186bf576a8a95d9b56eaa84a29ea0", "title": "StarBug - Red Dwarf", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11448", "versions": [{"hash": "3f040bafc307237180f79e4dfdf290c7", "version": "1.0"}]}, {"author": "alextfish", "desc": "The primary feature of this mod is: new ships to play! All your favourite air units from Starcraft 1 and 2, ported into FTL!\n\nThe Ship mod and the UI mod are designed to be used together, but if you find the Starcrafty icons confusing you could just use the SC2Ships with the default icons.\n", "thread_hash": "0f04d41207487b4870ca57bd4c6c3484", "title": "Starcraft Conversion", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=5238", "versions": [{"hash": "43dd7ced0e1f930604b5bce5e917fa9b", "version": "0.5 UI"}, {"hash": "958fba168d38361cce4f9ad280e83e99", "version": "0.5 Ships"}]}, {"author": "speedoflight", "desc": "For now, this is in alpha state.\n\nThe Defiant is a ship designed for assault purposes, there is no space for exploration equipment, colonial investigation or whatever. Its main purpose is to provide high reactor power to feed the weapons and the engines. Like the tv show, the Defiant has a cloaking system, installed by the romulans when they needed to defeat the Dominion. The Hull is reduced to 26 points to compensate a bit.\n\nReplaces the Kestrel-A ship.\n\nVarious new weapons are added, too.\n", "thread_hash": "4344e1d170bd33dbc01daf7de467cf3c", "title": "Star Trek Universe", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11844", "versions": [{"hash": "098dc2eb3865b701697e6a73420f57c6", "version": "0.1 Beta WIP"}, {"hash": "0443f8504ad6823a1ea875127a87273b", "version": "0.3 Beta WIP"}, {"hash": "c6880fd3e9423affe5ff9dc733580cad", "version": "0.2 Beta WIP"}, {"hash": "cddbb53e53745b8b1ac7cac7073e14e0", "version": "0.2 Beta 2013-03-02 WIP"}]}, {"author": "turbonutter", "desc": "Replaces all the standard versions of the ships, the only loadout changed is the millenium falcon.\n\nShip Replacements\n- Starbug = Fed A\n- Fed Shuttle = Zoltan A\n- Star Destroyer = Stealth A\n- Romulan = Rock A\n- Millennium Falcon = Kestrel A\n- Death Star = Slug A\n- Klingon D7 = Engi A\n- Klingon BOP = Mantis A\n- Big Fed ship = Crystal A\n", "thread_hash": "4d5b7a80c3721ffd597ee0eef050424b", "title": "turbonutter's Custom Ships", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=3520", "versions": [{"hash": "569b13f51f63e2fdce5da9749a79fa46", "version": "0.6 Beta"}]}, {"author": "DryEagle", "desc": "The Viper is an assault-class cruiser. Strong offensive potential and level 2 shields right off the bat, at the cost of weak secondary systems.\n\nReplaces the Kestrel-A ship.\nYou can just change which ship it overwrites in the blueprints file - all of the files the ship requires have unique names so it will work in any slot.\n", "thread_hash": "3153bdfc380e6c9741138c94270c7b8d", "title": "The Viper", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=10439", "versions": [{"hash": "502bbffee3198fc03178bdf9bff85050", "version": "1.0"}]}, {"author": "y0sho", "desc": "The layout is to as close to the actual ship as I could get it.\n\nReplaces the Kestrel-A ship.\n", "thread_hash": "6c54f0326a65451643374f9f9993cbbd", "title": "USS Defiant", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=12&t=11022", "versions": [{"hash": "164b884b9565eab150b0ef5a843f87c8", "version": "0.63"}]}, {"author": "nataryeahbuddy", "desc": "The Federation had a whole bunch of these Kestrel Cruisers lying around, so they decided to make use of them. This new mod comes with a different room arrangement, new augmentations, and new ship graphics.\n\nReplaces the Kestrel-A ship.\n", "thread_hash": "601e5da614262d4db26e034639055af6", "title": "The YAS-62", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11124", "versions": [{"hash": "ebefad606e6a66dd9e3ec4f9908e5d60", "version": "1.1"}]}, {"author": "nataryeahbuddy", "desc": "Developed by NATAR Weapons Development Division for the sole purpose of burning out enemy crews.\n", "thread_hash": "33cd8b79bb658db22bcc97805cf006b7", "title": "YTR-1335 Burnout", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11321", "versions": [{"hash": "4616d96003fda87b39d1541873fb111d", "version": "1.1"}]}, {"author": "karmos", "desc": "DronesPlus adds new drones to FTL.\n\nBeam II\nDeals one damage per room like the Beam I drone with 25% longer beam and a higher firing rate. 4 Power.\n\nIon I\nShoots ion blasts. 2 Power.\n\nIon II\nShoots ion blasts faster. 4 Power.\n\nMissile I\nShoots missiles. Pretty slow. 2 Power.\n\nMissile II\nShoots missiles. Less slow. 4 Power.\n\nFire\nA drone equipped with a beam that causes fires. 2 Power.\n\nCrystal\nShoots shield-piercing crystal shards. Only obtainable in the Crystal Sector. 3 Power.\n\nThe mod may (i.e. will probably) conflict with other mods that add drones. It is likely that we modders have used the same blueprint and weapon names at least once.\n", "thread_hash": "1d3f9f461d2d2eac83cef9801b6637fc", "title": "DronesPlus", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=10813", "versions": [{"hash": "20c0a6edfcd157d28c45f6edc41f6715", "version": "0.7.7"}]}, {"author": "Zaffre", "desc": "Discontinued.\n\nExtended Ion aims to add more to the arsenal of ion weapons by adding things like ion drones and lasers, and also upgraded ion blast weapons. The Engi ship starts out with some of these ion weapons and drones for a preview.\n\nReplaces the Engi-A ship.\n", "thread_hash": "1fdc0a91ac0e0b3ac7ad7c14516a7705", "title": "Extended Ion", "url": "http://www.ftlgame.com/forum/viewtopic.php?p=17749", "versions": [{"hash": "03831481149b1c1f1de100178ff5e7d9", "version": "1.0"}]}, {"author": "Law", "desc": "Part of the \"Law's Arsenal\" collection.\n\nThis beam hooks into the Federation Cruiser's artillery system, which instead of firing a piercing regular beam, causes ion damage instead. It's very good for disabling systems temporarily, though it is seen to be moderately overpowered.\n\nA note about these weapons:\nAny mods that replace the artillery system won't work together, so when you're selecting the mods to use, select only ONE of the mods. Any breakage of the game, I hold no responsibility if you haven't installed the mod correctly.\n", "thread_hash": "0742a7685928621da16ab70f016d29d1", "title": "Law's Arsenal - Ion Beam", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=4&t=2297", "versions": [{"hash": "358fb657d823b1ffdb99ba46acaf4927", "version": "0.3"}]}, {"author": "Law", "desc": "Part of the \"Law's Arsenal\" collection.\n\nThis mod teleports 5 bombs into the enemy ship where possible, and causes hull breaches when successful. Like the Ion Beam, this replaces the default artillery that comes with the Federation Cruiser.\n\nA note about these weapons:\nAny mods that replace the artillery system won't work together, so when you're selecting the mods to use, select only ONE of the mods. Any breakage of the game, I hold no responsibility if you haven't installed the mod correctly.\n", "thread_hash": "0742a7685928621da16ab70f016d29d1", "title": "Law's Arsenal - Splint Bombs", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=4&t=2297", "versions": [{"hash": "967e1365dfda1446ed5520629ce6517f", "version": "0.1"}]}, {"author": "Law", "desc": "Part of the \"Law's Arsenal\" collection.\n\nThis is a standard weapon mod (so it's very much compatible with the Ion Beam and the Splint Bombs), which simply increases the firing rate of missiles. Does 2 damage per shot, pierces shields, has a 4 second charge time, but requires 4 energy to operate and yes, your missile supply will drop quite quickly.\n\nVersion 0.1 replaced the Kestrel A ship.\n", "thread_hash": "0742a7685928621da16ab70f016d29d1", "title": "Law's Arsenal - Rapid Missiles", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=4&t=2297", "versions": [{"hash": "43ba9c8cca009994fe059283242387b5", "version": "0.1"}, {"hash": "8de20e49020d05b22685b05de40cbcb8", "version": "0.5"}]}, {"author": "Law", "desc": "Part of the \"Law's Arsenal\" collection.\n\nThe Athena is a missile launcher that doesn't use missiles. Instead, it is built over time, fueled by your reactor. There's nothing too special about this weapon (though the same could be said for a lot of the weapons here), but if you ever find yourself out of missiles and needing to get past a shield, this is a good choice.\n\nReplaces the Kestrel-A ship.\n\nUsing Rapid Missiles in conjunction? Check your mod order.\n\nA note about these weapons:\nAny mods that replace the artillery system won't work together, so when you're selecting the mods to use, select only ONE of the mods. Any breakage of the game, I hold no responsibility if you haven't installed the mod correctly.\n", "thread_hash": "0742a7685928621da16ab70f016d29d1", "title": "Law's Arsenal - Athena Missile Launcher", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=4&t=2297", "versions": [{"hash": "1bb19a2bbbb71416d2f495cec085f904", "version": "0.1"}]}, {"author": "HausHFG", "desc": "So, I just wanted to make overclocked weapons to add more variety to the game, so far, it seems to have worked. As on February 9th 2013, there are 4 new weapons, based off their original counterparts, after all, overclocking makes the weapon more powerful, not a different model.\n", "thread_hash": "ddba41960966ec48c84a5ecea4123ea9", "title": "Overclocked Weapons", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11468", "versions": [{"hash": "445f00599032a0d6be4551df06204300", "version": "0.5 WIP"}]}, {"author": "buzzyrecky", "desc": "This is Weaponanza, a mod focused on bring you unique weapons without losing the FTL feel of the game. As of Sept 20th, there are 16 weapons added, and I plan on continually adding more as time goes on.\n\nNote: Panacea is bugged, and there really isn't a way to fix it with the current way modding works. If you're going to use it for it's healing properties, avoid using it on rooms with systems in them, and you should be good.\n\nFeatures\n- NEW weapons (and counting) with custom textures\n- Improved weapons (do not replace originals)\n- Plenty of new events (for the weapons, of course)\n- Creeper Bombs (who doesn't want creepers?)\n", "thread_hash": "32c8c068af95b9284dd9ee3600750d9c", "title": "Weaponanza", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=4&t=2691", "versions": [{"hash": "d94a4fd0a94c4299999ae365d8acb4c5", "version": "1.1"}, {"hash": "c680700f88e314235d0efb3e204d794a", "version": "1.0"}]}, {"author": "sanmonku", "desc": "This mod replaces all of the existing planets and backgrounds and adds a lot more. Only 3 of the backgrounds are taken from Hubble, rest were done by me.\n", "thread_hash": "c1da7f250cb71a9f5c23d89d93f112f6", "title": "Better Planets and Backgrounds", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=9241", "versions": [{"hash": "f40d9d8d3b82c8c487018beae83ebbbf", "version": "1.2"}, {"hash": "8fb8c81074ef80f91ab9fa9a27b1c480", "version": "1.0"}, {"hash": "dcabfc921456dc2fa19e7f7d3659764a", "version": "1.3"}]}, {"author": "sanmonku", "desc": "This Mod replaces the Textures for the Asteroids and the ion storm lightning.\n", "thread_hash": "???", "title": "Better Asteroids", "url": "http://www.moddb.com/mods/better-planets-and-backgrounds/downloads/better-asteroids", "versions": [{"hash": "96a78e1850d8796a78a7cbda7da5676b", "version": "1.0"}]}, {"author": "liakad", "desc": "This Mod aims to create a greater diversity in mostly graphics and some parameters of FTL.\n", "thread_hash": "bacae38d34c3ad9eaf06d4d244d747cc", "title": "diversityMod", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=3363", "versions": [{"hash": "2534e515b635e15a9af90dacc376f900", "version": "0.3"}, {"hash": "ce799c0f1f698b855e6170025c6cbba5", "version": "0.2"}, {"hash": "179857cc78d0b8be747c20358e3fbb90", "version": "0.1"}]}, {"author": "splette", "desc": "I love FTL and I do like retro and pixel graphic. But I'm not a huge fan of the background graphic of FTL. They seem low res (especially the nebula animations). Some of the planets and galaxies look like they were painted over with an impressionist brush in Photoshop. So, I decided to replace the planets and backgrounds with higher quality versions, trying to stay as close as possible to the original subjects - and add a couple of new ones.\n\nThe only thing this mod does is replace the background graphics. That is planets, sun, stars, galaxies and the nebula. No other textures (ships etc) are being modified.\n\nPlease note: For the added backgrounds and planet, I had to modify the file events_imageList.xml (append is not possible in this case). Keep this in mind if you use any other mods that altered that file.\n", "thread_hash": "6c87d36c03578dc98b843a4fcd1288b7", "title": "High-res Background Graphics", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=4&t=3107", "versions": [{"hash": "f4c3f9b954c855677df8df856f6a0767", "version": "1.0"}]}, {"author": "Grognak", "desc": "Beginning Scrap Advantage is a simple example mod. All it does is give you some extra scrap when you first start a game.\n\nRename .ftl to .zip and extract it in order to study it further.\n", "thread_hash": "???", "title": "Beginning Scrap Advantage", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=4&t=2464", "versions": [{"hash": "b5a9fad1abec0018ea3d5b332bb6dce5", "version": "1.0"}]}, {"author": "Tails", "desc": "This is a slight upgrade to the Scrap Advantage mod that comes with Grognak's Mod Manager.\n", "thread_hash": "380a872c1ad35c81ce039e95efb3af85", "title": "Beginning Scrap Mod", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11094", "versions": [{"hash": "eac9c093b8e400eba73868c8253a6e91", "version": "2.1"}]}, {"author": "Collaboration", "desc": "The goal of this mod is to add new content in form of events and random texts, this will ensure that you are unlucky if you experience the same event twice in a row. It will add extra random texts to already existing events, like when you get to a beacon with nothing, you don't want to see the same text here. All events should be balanced, you won't get a lot of scrap for nothing, at least not more than you could if you played vanilla.\n", "thread_hash": "???", "title": "Additional Events and Texts", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11094", "versions": [{"hash": "404bc800a8fd9febfe67475454e2c9c3", "version": "2012-10-04"}]}, {"author": "Catalyst78", "desc": "Tired of slaughtering every mercenary that darer fly your path of destruction? Want some of those neat little blue options to spice up your mercenary encounter? Well look no further!\n\nWith the intention of making mercenary encounters a little more interesting I have tripled the amount of code in the mercenary encounter event!\n", "thread_hash": "daf2f98ce1225cc55781f581c23c033d", "title": "OliMods - Better Mercenaries ", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11338", "versions": [{"hash": "91ee0a6f71d37c24ca02c1b52a430e76", "version": "1.3"}]}, {"author": "Stickman", "desc": "This simple mod tweaks the secret ship unlock quest line to make it slightly less frustrating.\n\nSpecifics (with some potential spoilers):\n\n**Spoilers!**\nOnce you've opened the stasis pod, entering the required homeworld sector with the secret crew member will put a quest marker at a secret sector wormhole location. This should alleviate the frustration of opening the pod, finding the correct homeworld, but missing the wormhole event.\n**End Spoilers**\n\nAlternate version with increased quest start probability:\n\nI've also created a second version (Crystal Quest - Start Boost) which makes the pod event a guaranteed node in Engi space and a possible node in Zoltan space. If you try this version, let me know if you run in to too many pods!\n", "thread_hash": "37f6ffaccd9406637645c521085a3288", "title": "Crystal Quest Tweak", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=3483", "versions": [{"hash": "7b26f95c8b1147030683d0ea1f84a676", "version": "1.0"}, {"hash": "db63e6d4f5a5fb0bfbc6ecc42c43afc6", "version": "1.0 Start Boost"}]}, {"author": "IcarusTyler", "desc": "Have you been playing FTL for 30+ hours already? Are you seeing the same names appear over and over again? Are you tired of having the same old crewmen re-join your ship during your journey?\n\nThe Extra Names Mod adds over 400 new, unique and hand-picked names to FTL.\n\n140 female first names, like\n- Annika\n- Hannah\n- Selene\n\n138 male first names, including\n- Harvey\n- Douglas\n- Miles\n\nAnd 129 unisex last Names, in the style of\n- Freeman\n- Jensen\n- Collins\n", "thread_hash": "d3a98eeaa6ccd4259424b2707294e760", "title": "Extra Names Mod", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=3293", "versions": [{"hash": "be28ee23c37bfb0aec2f7f684c8779cc", "version": "1.1"}]}, {"author": "Attackid", "desc": "Ghosts appear in FTL as an AI race that currently cannot join your crew, which is something I thought should be changed.\n\nFeatures\n- 50 health (can't be changed)\n- 50% visible\n- Can survive with NO oxygen\n\nThis mod has 2 varieies.\n\nVersion 1\nThis version replaces all starting human crew on all ships with ghosts\n\nVersion 2\nThis version replaces all starting human crew on all ships with ghosts\nHowever you can enable this mod and still play as humans.\nOnce you reselect a ship in the hanger the ghosts will turn back into humans. Just go back to the main menu (ESC) to turn them back into ghosts. So you can have this mod always enabled!\n", "thread_hash": "a4273294427aba035ba56158fe0d6922", "title": "Ghosts", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=3453", "versions": [{"hash": "5623c3ed75ae42ae0a2b86db3d8cb67c", "version": "0.2 Ghosts Only"}, {"hash": "6057fe3c431567787f6998a5d71fc3b8", "version": "0.2 Toggle"}]}, {"author": "DryEagle", "desc": "I present to you a very small, minor and incredibly compatible-with-everything mod which changes some of the event text.\n\nAny time you lose a crew member to an event, this will in some way be caused by (usually eaten by) a grue.\n\nIf you are running any other mods which edit events, load this first so that it won't conflict with them, though that is very unlikely as it only edits very specific parts of text and not any event names etc.\n", "thread_hash": "1b68447189c0030a75f563830ecc1150", "title": "Gruesome", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=11183", "versions": [{"hash": "0a6a4ef02a8c316e11f22b0ac4bae0db", "version": "1.0"}]}, {"author": "karmos", "desc": "UnlockedAugmentations is a small mod that makes Vanilla ship-specific augmentations (Engi Med-bot Dispersal, Drone Reactor Booster, Mantis Pheromones, Rock Plating, Slug Repair Gel, Titanium System Casing, Zoltan Shield) findable in events and shops in their respective racial sectors.\n\nEngi Med-bot Dispersal - Engi Controlled and Engi Home Sectors\nDrone Reactor Booster - Nebula Sectors\nMantis Pheromones - Mantis Controlled and Mantis Home Sectors\nRock Plating - Rock Controlled and Rock Home Sectors\nSlug Repair Gel - Slug Controlled and Slug Home Nebula Sectors\nTitanium System Casing - Pirate Sectors\nZoltan Shield - Zoltan Controlled and Zoltan Home Sectors\n\nEach augmentation is as rare as the Weapons Pre-Igniter in their sectors, meaning each is ultimately rarer than other augments in Vanilla due to their sector specificity. Titanium Systems Casing and Drone Reactor Boosters are as rare as Repair Arms, Stealth Weapons, Advanced FTL Navigation, and FTL Jammers in their respective sectors. Augmentation costs have been modified to reflect accurate sale values and may be adjusted in later versions of the mod.\n\nThis mod shouldn't conflict with other mods unless augmentations are being tweaked. If you are using a ship or weapons mod in conjunction with UnlockedAugmentations and want to preserve the changes made to augmentations in those mods, simply place UnlockedAugmentations above the other mods in GMM.\n", "thread_hash": "e31ecbbdf3da62a873298a818f02bab2", "title": "UnlockedAugmentations", "url": "http://www.ftlgame.com/forum/viewtopic.php?f=11&t=10997", "versions": [{"hash": "09613c51e19c8139e6f3867ecd61ae1c", "version": "1.1"}]}]}}